---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotPlaceBoundaryConditions
source: html/608456c8-63d1-5cfc-eff8-fc648facdbf4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralLoadFailures.CannotPlaceBoundaryConditions Property

A boundary condition is already created on the selected element. Duplicate boundary conditions are not allowed. Click the Replace button to delete previous definition of boundary condition or cancel the operation.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceBoundaryConditions { get; }
```